# -*- coding: utf-8 -*-

'''
格式化字符串,和C一致：
%d  整数,可以指定是否补0和整数的位数
%f  浮点数,可以指定是否补0和小数的位数
%s  字符串，不知道用哪个，%s永远起作用，它会把任何数据类型转换为字符串
%x  十六进制整数
'''
print('',
      'Hello, %s' % 'world', '\n',
      'Hi %s, you have $%d.' % ('Michael', 1000000), '\n',
      '%002d-%3d' % (3, 1), '\n',
      '%.3f' % 3.1415926, '\n',
      'Age:%s. Gender:%s' % (25, True), '\n',
      'growth rate: %d%%' % 7, '\n'
      )

s1 = 72
s2 = 85
r1=(s2-s1)/s1*100
rAll=s2-s1    #假设总分100分
print('小明成绩比去年提升%.1f%%' % r1,'\n',
'按满分100分，占比提升%.1f%%' % rAll
)
